In [1]:
import sqlite3

In [2]:
db=sqlite3.connect("set_database")

In [3]:
cursor=db.cursor()

In [4]:
cursor.execute("create table set_database(phone_num int, email_id text, course_name text,fee_paid int)")

In [5]:
cursor.execute("insert into set_database values(0099887766,'yt@gmail.com','datascience',40000),(1122334455,'hj@gmail.com','datascience',90000),(6655447788,'sd@gmail.com','datascience',50000),(3344556633,'as@gmail.com','datascience',30000)")

In [6]:
db.commit()

In [8]:
result=cursor.execute("select*from set_database")

for row in result:
    print(row)

(99887766, 'yt@gmail.com', 'datascience', 40000)
(1122334455, 'hj@gmail.com', 'datascience', 90000)
(6655447788, 'sd@gmail.com', 'datascience', 50000)
(3344556633, 'as@gmail.com', 'datascience', 30000)

In [10]:
with open ('DT_students.csv','r')as file:
    no_record=0
    for row in file:
        cursor.execute("insert into set_database values (?,?,?,? )",row.split(","))
        db.commit()
        no_record=no_record+1

In [12]:
print(no_record,'records.inserted')

20 records.inserted

In [13]:
result=cursor.execute("select*from set_database")
for row in result:
    print(row)

(99887766, 'yt@gmail.com', 'datascience', 40000)
(1122334455, 'hj@gmail.com', 'datascience', 90000)
(6655447788, 'sd@gmail.com', 'datascience', 50000)
(3344556633, 'as@gmail.com', 'datascience', 30000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [14]:
sql="select*from set_database where course_name='datascience'"

In [15]:
result=cursor.execute(sql)
for row in result:
    print(row)

(99887766, 'yt@gmail.com', 'datascience', 40000)
(1122334455, 'hj@gmail.com', 'datascience', 90000)
(6655447788, 'sd@gmail.com', 'datascience', 50000)
(3344556633, 'as@gmail.com', 'datascience', 30000)

In [18]:
sql="delete from set_database where phone_num = 3344556633"

In [19]:
cursor.execute(sql)
db.commit()

In [21]:
result=cursor.execute("select*from set_database")
for row in result:
    print(row)

(99887766, 'yt@gmail.com', 'datascience', 40000)
(1122334455, 'hj@gmail.com', 'datascience', 90000)
(6655447788, 'sd@gmail.com', 'datascience', 50000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)

In [22]:
result=cursor.execute("select*from set_database order by fee_paid desc")

In [23]:
for row in result:
    print(row)

(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(1122334455, 'hj@gmail.com', 'datascience', 90000)
(6655447788, 'sd@gmail.com', 'datascience', 50000)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(99887766, 'yt@gmail.com', 'datascience', 40000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)

In [24]:
sql="update set_database set course_name = 'data science' where phone_num = 9988776613"

In [25]:
cursor.execute(sql)

In [26]:
sql="select*from set_database where phone_num = 9988776613"

In [27]:
result=cursor.execute(sql)
for row in result:
    print(row)

(9988776613, 'student13@gmail.com', 'data science', 23000)

In [28]:
sql="select phone_num,email_id,fee_paid from set_database where course_name='data science' and fee_paid <=50000"

In [29]:
result=cursor.execute(sql)
for row in result:
    print(row)

(9988776613, 'student13@gmail.com', 23000)

In [38]:
sql="select phone_num,email_id,fee_paid from set_database where course_name='datascience' and fee_paid <=50000"

In [39]:
result=cursor.execute(sql)
for row in result:
    print(row)

(99887766, 'yt@gmail.com', 40000)
(6655447788, 'sd@gmail.com', 50000)

In [40]:
sql="update set_database set fee_paid=140000 where phone_num in (9988776608,9988776615,9988776609)"

In [41]:
cursor.execute(sql)

In [42]:
result=cursor.execute("select phone_num, fee_paid from set_database where phone_num in (9988776608,9988776615,9988776609)")

In [43]:
for row in result:
    print(row)

(9988776608, 140000)
(9988776609, 140000)
(9988776615, 140000)

In [55]:
sql="update set_database set course_name = 'Tableau' where phone_num between 9988776604 and 9988776606"

In [56]:
cursor.execute(sql)

In [57]:
result=cursor.execute("select phone_num,course_name from set_database where course_name = 'Tableau'")

In [58]:
for row in result:
    print(row)

(9988776604, 'Tableau')
(9988776605, 'Tableau')
(9988776606, 'Tableau')

In [59]:
result=cursor.execute("select min (fee_paid)from set_database")

print('minmum fees=', result.fetchone())

minmum fees= (23000,)

In [60]:
result=cursor.execute("select max (fee_paid)from set_database")

print('maximum fees=', result.fetchone())

maximum fees= (140000,)

In [61]:
db=sqlite3.connect("mn_course.db")

In [62]:
cur=db.cursor()

In [63]:
cur.execute("create table cou1(courseid int,coursename text,duration int)")

In [65]:
cur.execute("create table set1(roll_no int, studentname text,age int,courseid int,foreign key(courseid)references cou1(courseid))")

In [66]:
cur.execute("insert into cou1 values(78,'data science',12),(101,'data science',7),(56,'data science',4)")

print(cur.rowcount,"record(s) inserted")

db.commit()

3 record(s) inserted

In [67]:
cur.execute("insert into set1 values(1,'jack',22,78),(2,'john',21,56),(3,'rudo',18,78),(4,'jim',21,56)")

print(cur.rowcount,"record(s) inserted")

db.commit()

4 record(s) inserted

In [69]:
result=cur.execute("select * from cou1")

for row in result:
    print(row)

(78, 'data science', 12)
(101, 'data science', 7)
(56, 'data science', 4)

In [70]:
result=cur.execute("select * from set1")

for row in result:
    print(row)

(1, 'jack', 22, 78)
(2, 'john', 21, 56)
(3, 'rudo', 18, 78)
(4, 'jim', 21, 56)

In [71]:
result=cur.execute("select courseid from cou1 where coursename='data science'")

for i in result:
    print(i)

(78,)
(101,)
(56,)

In [72]:
result=cur.execute("select*from set1 where courseid=(select courseid from cou1 where coursename='data science')")

result.fetchall()

[(1, 'jack', 22, 78), (3, 'rudo', 18, 78)]

In [76]:
result=cur.execute("select*from set1 where courseid=(select courseid from cou1 where coursename='python course')")

result.fetchall()

[]

In [2]:
result=cursor.execute("select*from student_data")

for row in result:
    print(row)

NameError: name 'cursor' is not defined